Revit 2027 API
BuiltInFailures.CurtainWallFailures.DependentGridlineMayBeDeleted Property
 Type generated gridlines will become non-associated due to changes in the type. Press delete if you wish to remove them instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DependentGridlineMayBeDeleted { get; }
Public Shared ReadOnly Property DependentGridlineMayBeDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DependentGridlineMayBeDeleted {
	FailureDefinitionId^ get ();
}
static member DependentGridlineMayBeDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace